turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4c/atdf/ATSAM4C16C_0.atdf
      <value-group caption="" name="ADC_EMR__OSR">
        <value caption="No averaging. ADC sample rate is maximum." name="NO_AVERAGE" value="0x0"/>
        <value caption="1-bit enhanced resolution by averaging. ADC sample rate divided by 4." name="OSR4" value="0x1"/>
        <value caption="2-bit enhanced resolution by averaging. ADC sample rate divided by 16." name="OSR16" value="0x2"/>
      </value-group>
      <value-group caption="" name="ADC_EMR__ASTE">
        <value caption="The average requests several trigger events." name="MULTI_TRIG_AVERAGE" value="0"/>
        <value caption="The average requests only one trigger event." name="SINGLE_TRIG_AVERAGE" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_ACR__IRVCE">
        <value caption="The internal reference voltage is stuck at the default value (see the Electrical Characteristics for further details)." name="STUCK_AT_DEFAULT" value="0"/>
        <value caption="The internal reference voltage is defined by field IRVS." name="SELECTION" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0" name="PASSWD" value="0x414443"/>
      </value-group>
    </module>
    <module caption="Advanced Encryption Standard" name="AES" version="6149P">
      <register-group name="AES">
        <register caption="Control Register" name="AES_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Start Processing" mask="0x00000001" name="START"/>
          <bitfield caption="Software Reset" mask="0x00000100" name="SWRST"/>
        </register>
        <register caption="Mode Register" name="AES_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Processing Mode" mask="0x00000001" name="CIPHER"/>
          <bitfield caption="GCM Automatic Tag Generation Enable" mask="0x00000002" name="GTAGEN"/>
          <bitfield caption="Dual Input Buffer" mask="0x00000008" name="DUALBUFF" values="AES_MR__DUALBUFF"/>
          <bitfield caption="Processing Delay" mask="0x000000F0" name="PROCDLY"/>
          <bitfield caption="Start Mode" mask="0x00000300" name="SMOD" values="AES_MR__SMOD"/>
          <bitfield caption="Key Size" mask="0x00000C00" name="KEYSIZE" values="AES_MR__KEYSIZE"/>
          <bitfield caption="Operation Mode" mask="0x00007000" name="OPMOD" values="AES_MR__OPMOD"/>
          <bitfield caption="Last Output Data Mode" mask="0x00008000" name="LOD"/>
          <bitfield caption="Cipher Feedback Data Size" mask="0x00070000" name="CFBS" values="AES_MR__CFBS"/>
          <bitfield caption="Key" mask="0x00F00000" name="CKEY" values="AES_MR__CKEY"/>
        </register>
        <register caption="Interrupt Enable Register" name="AES_IER" offset="0x10" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Enable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00000002" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00000008" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000010" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Enable" mask="0x00000100" name="URAD"/>
          <bitfield caption="GCM Tag Ready Interrupt Enable" mask="0x00010000" name="TAGRDY"/>
        </register>
        <register caption="Interrupt Disable Register" name="AES_IDR" offset="0x14" rw="W" size="4">
          <bitfield caption="Data Ready Interrupt Disable" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x00000002" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00000008" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00000010" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Disable" mask="0x00000100" name="URAD"/>
          <bitfield caption="GCM Tag Ready Interrupt Disable" mask="0x00010000" name="TAGRDY"/>
        </register>
        <register caption="Interrupt Mask Register" name="AES_IMR" offset="0x18" rw="R" size="4">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x00000002" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x00000008" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00000010" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Mask" mask="0x00000100" name="URAD"/>
          <bitfield caption="GCM Tag Ready Interrupt Mask" mask="0x00010000" name="TAGRDY"/>
        </register>
        <register caption="Interrupt Status Register" name="AES_ISR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Data Ready" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="End of RX Buffer" mask="0x00000002" name="ENDRX"/>
          <bitfield caption="End of TX Buffer" mask="0x00000004" name="ENDTX"/>
          <bitfield caption="RX Buffer Full" mask="0x00000008" name="RXBUFF"/>
          <bitfield caption="TX Buffer Empty" mask="0x00000010" name="TXBUFE"/>
          <bitfield caption="Unspecified Register Access Detection Status" mask="0x00000100" name="URAD"/>
          <bitfield caption="Unspecified Register Access" mask="0x0000F000" name="URAT" values="AES_ISR__URAT"/>
          <bitfield caption="GCM Tag Ready" mask="0x00010000" name="TAGRDY"/>
        </register>
